In [1]:
import pandas as pd
data={"name":["jony","limon","Boss"],
      "age":[25,12,50],
      "salary":[30000,45000,40000]}
df=pd.DataFrame(data)
print(df)

    name  age  salary
0   jony   25   30000
1  limon   12   45000
2   Boss   50   40000

In [2]:
data=pd.read_excel("Data.xlsx")
print(data)

   Serial No      ID   Name   Salary  Gender
0          1  ID1001   John  50000.0    Male
1          2  ID1002   Mike  60000.0    Male
2          3  ID1003  Alice  55000.0  Female
3          4  ID1004   Sara  48000.0  Female
4          5  ID1005    Tom  51000.0    Male
5          6  ID1006    Bob  62000.0    Male
6          7  ID1007   Anna  59000.0  Female
7          8  ID1008  David  50000.0    Male
8          9  ID1009  Karen  52000.0  Female
9         10  ID1010    Leo      NaN    Male

In [3]:
print(data.head(5)) #print first 5 row

   Serial No      ID   Name  Salary  Gender
0          1  ID1001   John   50000    Male
1          2  ID1002   Mike   60000    Male
2          3  ID1003  Alice   55000  Female
3          4  ID1004   Sara   48000  Female
4          5  ID1005    Tom   51000    Male

In [5]:
print(data.info()) #print data type

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Serial No  10 non-null     int64
 1   ID         10 non-null     object
 2   Name       10 non-null     object
 3   Salary     10 non-null     int64
 4   Gender     10 non-null     object
dtypes: int64(2), object(3)
memory usage: 532.0+ bytes
None

In [6]:
data.describe()  #Describtion of data

       Serial No        Salary
count   10.00000     10.000000
mean     5.50000  55100.000000
std      3.02765   5043.147166
min      1.00000  48000.000000
25%      3.25000  51250.000000
50%      5.50000  54000.000000
75%      7.75000  59750.000000
max     10.00000  62000.000000

In [16]:
print(data.isnull().sum()) #Print number of null data

Serial No    0
ID           0
Name         0
Salary       1
Gender       0
dtype: int64

In [11]:
print(data["Salary"].duplicated().sum())    #Print how many duplicant in colum

1

In [12]:
print(data.drop_duplicates("Salary"))         #drop duplicant data

   Serial No      ID   Name  Salary  Gender
0          1  ID1001   John   50000    Male
1          2  ID1002   Mike   60000    Male
2          3  ID1003  Alice   55000  Female
3          4  ID1004   Sara   48000  Female
4          5  ID1005    Tom   51000    Male
5          6  ID1006    Bob   62000    Male
6          7  ID1007   Anna   59000  Female
8          9  ID1009  Karen   52000  Female
9         10  ID1010    Leo   61000    Male

In [15]:
print(data.isnull())

   Serial No     ID   Name  Salary  Gender
0      False  False  False   False   False
1      False  False  False   False   False
2      False  False  False   False   False
3      False  False  False   False   False
4      False  False  False   False   False
5      False  False  False   False   False
6      False  False  False   False   False
7      False  False  False   False   False
8      False  False  False   False   False
9      False  False  False    True   False

In [17]:
print(data.dropna()) #Drop row where null value

   Serial No      ID   Name   Salary  Gender
0          1  ID1001   John  50000.0    Male
1          2  ID1002   Mike  60000.0    Male
2          3  ID1003  Alice  55000.0  Female
3          4  ID1004   Sara  48000.0  Female
4          5  ID1005    Tom  51000.0    Male
5          6  ID1006    Bob  62000.0    Male
6          7  ID1007   Anna  59000.0  Female
7          8  ID1008  David  50000.0    Male
8          9  ID1009  Karen  52000.0  Female

In [35]:
print(data)

{'name': ['jony', 'limon', 'Boss'], 'age': [25, 12, 50], 'salary': [30000, 45000, 40000]}

In [27]:
import numpy as np
print(data.replace(np.nan,"hi"))

   Serial No      ID   Name   Salary  Gender
0          1  ID1001   John  50000.0    Male
1          2  ID1002   Mike  60000.0    Male
2          3  ID1003  Alice  55000.0  Female
3          4  ID1004   Sara  48000.0  Female
4          5  ID1005    Tom  51000.0    Male
5          6  ID1006    Bob  62000.0    Male
6          7  ID1007   Anna  59000.0  Female
7          8  ID1008  David  50000.0    Male
8          9  ID1009  Karen  52000.0  Female
9         10  ID1010    Leo  20000.0    Male

In [29]:
data["Salary"]=data["Salary"].replace(np.nan,20000)  #Replace null value in a coloum
print(data)

   Serial No      ID   Name   Salary  Gender
0          1  ID1001   John  50000.0    Male
1          2  ID1002   Mike  60000.0    Male
2          3  ID1003  Alice  55000.0  Female
3          4  ID1004   Sara  48000.0  Female
4          5  ID1005    Tom  51000.0    Male
5          6  ID1006    Bob  62000.0    Male
6          7  ID1007   Anna  59000.0  Female
7          8  ID1008  David  50000.0    Male
8          9  ID1009  Karen  52000.0  Female
9         10  ID1010    Leo  20000.0    Male

In [30]:
print(data["Salary"].mean()) #mean of salary

50700.0

In [39]:

print(data.fillna(method="ffill")) #fill with forward valu in nullvalue

   Serial No      ID   Name   Salary  Gender
0          1  ID1001   John  50000.0    Male
1          2  ID1002   Mike  60000.0    Male
2          3  ID1003  Alice  55000.0  Female
3          4  ID1004   Sara  48000.0  Female
4          5  ID1005    Tom  51000.0    Male
5          6  ID1006    Bob  62000.0    Male
6          7  ID1007   Anna  59000.0  Female
7          8  ID1008  David  50000.0    Male
8          9  ID1009  Karen  52000.0  Female
9         10  ID1010    Leo  52000.0    Male

C:\Users\User\AppData\Local\Temp\ipykernel_9952\3985543796.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(data.fillna(method="ffill"))

In [40]:

print(data.fillna(method="bfill"))  #fill with before value in nullvalue

   Serial No      ID   Name   Salary  Gender
0          1  ID1001   John  50000.0    Male
1          2  ID1002   Mike  60000.0    Male
2          3  ID1003  Alice  55000.0  Female
3          4  ID1004   Sara  48000.0  Female
4          5  ID1005    Tom  51000.0    Male
5          6  ID1006    Bob  62000.0    Male
6          7  ID1007   Anna  59000.0  Female
7          8  ID1008  David  50000.0    Male
8          9  ID1009  Karen  52000.0  Female
9         10  ID1010    Leo      NaN    Male

C:\Users\User\AppData\Local\Temp\ipykernel_9952\2967332630.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(data.fillna(method="bfill"))

In [58]:
df.loc[(df["salary"]>55000),"Quality"]="High"   #print new column with condition 
df.loc[(df["salary"]<=55000),"Quality"]="Low"
print(df.head(10))

    name  age  salary Quality
0   jony   25   30000     Low
1  limon   12   45000     Low
2   Boss   50   40000     Low

In [63]:
data["namsal"]=data["Name"].str.capitalize()+data["Salary"].astype(str)  #concatinat two column 
print(data)

   Serial No      ID   Name   Salary  Gender        namsal
0          1  ID1001   John  50000.0    Male   John50000.0
1          2  ID1002   Mike  60000.0    Male   Mike60000.0
2          3  ID1003  Alice  55000.0  Female  Alice55000.0
3          4  ID1004   Sara  48000.0  Female   Sara48000.0
4          5  ID1005    Tom  51000.0    Male    Tom51000.0
5          6  ID1006    Bob  62000.0    Male    Bob62000.0
6          7  ID1007   Anna  59000.0  Female   Anna59000.0
7          8  ID1008  David  50000.0    Male  David50000.0
8          9  ID1009  Karen  52000.0  Female  Karen52000.0
9         10  ID1010    Leo      NaN    Male        Leonan

In [64]:
data["Bonus"]=(data["Salary"]/100)*20  #create new coloum with condition
print(data)

   Serial No      ID   Name   Salary  Gender        namsal    Bonus
0          1  ID1001   John  50000.0    Male   John50000.0  10000.0
1          2  ID1002   Mike  60000.0    Male   Mike60000.0  12000.0
2          3  ID1003  Alice  55000.0  Female  Alice55000.0  11000.0
3          4  ID1004   Sara  48000.0  Female   Sara48000.0   9600.0
4          5  ID1005    Tom  51000.0    Male    Tom51000.0  10200.0
5          6  ID1006    Bob  62000.0    Male    Bob62000.0  12400.0
6          7  ID1007   Anna  59000.0  Female   Anna59000.0  11800.0
7          8  ID1008  David  50000.0    Male  David50000.0  10000.0
8          9  ID1009  Karen  52000.0  Female  Karen52000.0  10400.0
9         10  ID1010    Leo      NaN    Male        Leonan      NaN

In [65]:
def extract(value):                              #Create new  column for sortform of a column
    return value[0:3]
data["short"]=data["Name"].map(extract)
print(data)

   Serial No      ID   Name   Salary  Gender        namsal    Bonus short
0          1  ID1001   John  50000.0    Male   John50000.0  10000.0   Joh
1          2  ID1002   Mike  60000.0    Male   Mike60000.0  12000.0   Mik
2          3  ID1003  Alice  55000.0  Female  Alice55000.0  11000.0   Ali
3          4  ID1004   Sara  48000.0  Female   Sara48000.0   9600.0   Sar
4          5  ID1005    Tom  51000.0    Male    Tom51000.0  10200.0   Tom
5          6  ID1006    Bob  62000.0    Male    Bob62000.0  12400.0   Bob
6          7  ID1007   Anna  59000.0  Female   Anna59000.0  11800.0   Ann
7          8  ID1008  David  50000.0    Male  David50000.0  10000.0   Dav
8          9  ID1009  Karen  52000.0  Female  Karen52000.0  10400.0   Kar
9         10  ID1010    Leo      NaN    Male        Leonan      NaN   Leo

In [70]:
gp=data.groupby(["Gender"]).agg({"ID":"count"})    #Create group based column value
print(gp)

        ID
Gender
Female   4
Male     6

In [4]:
df2=df.copy()
df2.loc[0,"age"]=60
df2.loc[1,"age"]=70
df2.loc[2,"age"]=80
print(df2)

    name  age  salary
0   jony   60   30000
1  limon   70   45000
2   Boss   80   40000

In [5]:
print(df.compare(df2))   #compare two charts

   age
  self other
0   25    60
1   12    70
2   50    80

In [6]:
print(df.compare(df2,keep_shape=True))

  name        age       salary
  self other self other   self other
0  NaN   NaN   25    60    NaN   NaN
1  NaN   NaN   12    70    NaN   NaN
2  NaN   NaN   50    80    NaN   NaN

In [7]:
data={"name":["jony","limon","Boss"],
      "id":[2063,2026,2030]}
df2=pd.DataFrame(data)
print(df2)

    name    id
0   jony  2063
1  limon  2026
2   Boss  2030

In [9]:
print(pd.merge(df,df2,on="name"))  #marge two charts

    name  age  salary    id
0   jony   25   30000  2063
1  limon   12   45000  2026
2   Boss   50   40000  2030

In [10]:
print(pd.concat([df,df2]))

    name   age   salary      id
0   jony  25.0  30000.0     NaN
1  limon  12.0  45000.0     NaN
2   Boss  50.0  40000.0     NaN
0   jony   NaN      NaN  2063.0
1  limon   NaN      NaN  2026.0
2   Boss   NaN      NaN  2030.0